examples/tumor_chip_linear_gradient/data/diagnostic/ladder/case/constant/polyMesh/boundary
/*--------------------------------*- C++ -*----------------------------------*\
| =========                 |                                                 |
| \\      /  F ield         | OpenFOAM: The Open Source CFD Toolbox           |
|  \\    /   O peration     | Version:  2406                                  |
|   \\  /    A nd           | Website:  www.openfoam.com                      |
|    \\/     M anipulation  |                                                 |
\*---------------------------------------------------------------------------*/
FoamFile
{
    version     2.0;
    format      ascii;
    arch        "LSB;label=32;scalar=64";
    class       polyBoundaryMesh;
    location    "constant/polyMesh";
    object      boundary;
}
// * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * //

12
(
    inlet_0
    {
        type            patch;
        nFaces          9;
        startFace       28528;
    }
    inlet_1
    {
        type            patch;
        nFaces          9;
        startFace       28537;
    }
    inlet_2
    {
        type            patch;
        nFaces          9;
        startFace       28546;
    }
    inlet_3
    {
        type            patch;
        nFaces          9;
        startFace       28555;
    }
    inlet_4
    {
        type            patch;
        nFaces          9;
        startFace       28564;
    }
    inlet_5
    {
        type            patch;
        nFaces          9;
        startFace       28573;
    }
    inlet_6
    {
        type            patch;
        nFaces          9;
        startFace       28582;
    }
    inlet_7
    {
        type            patch;
        nFaces          9;
        startFace       28591;
    }
    outlet
    {
        type            patch;
        nFaces          72;
        startFace       28600;
    }
    walls
    {
        type            wall;
        inGroups        1(wall);
        nFaces          0;
        startFace       28672;
    }
    floor
    {
        type            wall;
        inGroups        1(wall);
        nFaces          400;
        startFace       28672;
    }
    frontAndBack
    {
        type            empty;
        inGroups        1(empty);
        nFaces          28800;
        startFace       29072;
    }
)

// ************************************************************************* //
